package by.it.group510901.jalilova.lesson02;

import java.util.ArrayList;
import java.util.List;
import java.util.Arrays;
/*
Даны события events
реализуйте метод calcStartTimes, так, чтобы число включений регистратора на
заданный период времени (1) было минимальным, а все события events
были зарегистрированы.
Алгоритм жадный. Для реализации обдумайте надежный шаг.
*/

public class A_VideoRegistrator {

    public static void main(String[] args) {
        A_VideoRegistrator instance = new A_VideoRegistrator();
        double[] events = new double[]{1, 1.1, 1.6, 2.2, 2.4, 2.7, 3.9, 8.1, 9.1, 5.5, 3.7};
        List<Double> starts = instance.calcStartTimes(events, 1); //рассчитаем моменты старта, с длинной сеанса 1
        System.out.println(starts);                            //покажем моменты старта
    }

    //модификаторы доступа опущены для возможности тестирования
    List<Double> calcStartTimes(double[] events, double workDuration) {
        //events - события которые нужно зарегистрировать
        //timeWorkDuration время работы видеокамеры после старта
        List<Double> result;
        result = new ArrayList<>();
        int i = 0;                              //i - это индекс события events[i]
        Arrays.sort(events);

        while (i < events.length) {
            // 3. БЕРЕМ ПЕРВОЕ НЕПОКРЫТОЕ СОБЫТИЕ
            double startTime = events[i];
            result.add(startTime);

            // 4. ВЫЧИСЛЯЕМ ВРЕМЯ ОКОНЧАНИЯ РАБОТЫ КАМЕРЫ
            double endTime = startTime + workDuration;

            // 5. ПРОПУСКАЕМ ВСЕ СОБЫТИЯ, КОТОРЫЕ ПОПАДАЮТ В ИНТЕРВАЛ
            while (i < events.length && events[i] <= endTime) {
                i++;
            }

            // Если остались события, цикл повторяется
        }


        return result;                        //вернем итог
    }
}
